MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cx_sg1/thirdparty/pic32cx_sg1/component/ecia.h
/*
 * Component description for ECIA
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2020-03-24T11:15:30Z */
#ifndef _0525SG12_ECIA_COMPONENT_H_
#define _0525SG12_ECIA_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR ECIA                                         */
/* ************************************************************************** */

/* -------- ECIA_SRC8 : (ECIA Offset: 0x00) (R/W 32) GIRQ8 Source Register -------- */
#define ECIA_SRC8_RESETVALUE                  _UINT32_(0x00)                                       /*  (ECIA_SRC8) GIRQ8 Source Register  Reset Value */

#define ECIA_SRC8_Msk                         _UINT32_(0x00000000)                                 /* (ECIA_SRC8) Register Mask  */


/* -------- ECIA_EN_SET8 : (ECIA Offset: 0x04) (R/W 32) GIRQ8 Enable Set Register -------- */
#define ECIA_EN_SET8_RESETVALUE               _UINT32_(0x00)                                       /*  (ECIA_EN_SET8) GIRQ8 Enable Set Register  Reset Value */

#define ECIA_EN_SET8_Msk                      _UINT32_(0x00000000)                                 /* (ECIA_EN_SET8) Register Mask  */


/* -------- ECIA_RESULT8 : (ECIA Offset: 0x08) ( R/ 32) GIRQ8 Result Register -------- */
#define ECIA_RESULT8_RESETVALUE               _UINT32_(0x00)                                       /*  (ECIA_RESULT8) GIRQ8 Result Register  Reset Value */

#define ECIA_RESULT8_Msk                      _UINT32_(0x00000000)                                 /* (ECIA_RESULT8) Register Mask  */


/* -------- ECIA_EN_CLR8 : (ECIA Offset: 0x0C) (R/W 32) GIRQ8 Enable Clear Register -------- */
#define ECIA_EN_CLR8_RESETVALUE               _UINT32_(0x00)                                       /*  (ECIA_EN_CLR8) GIRQ8 Enable Clear Register  Reset Value */

#define ECIA_EN_CLR8_Msk                      _UINT32_(0x00000000)                                 /* (ECIA_EN_CLR8) Register Mask  */


/* -------- ECIA_SRC9 : (ECIA Offset: 0x14) (R/W 32) GIRQ9 Source Register -------- */
#define ECIA_SRC9_RESETVALUE                  _UINT32_(0x00)                                       /*  (ECIA_SRC9) GIRQ9 Source Register  Reset Value */

#define ECIA_SRC9_Msk                         _UINT32_(0x00000000)                                 /* (ECIA_SRC9) Register Mask  */


/* -------- ECIA_EN_SET9 : (ECIA Offset: 0x18) (R/W 32) GIRQ9 Enable Set Register -------- */
#define ECIA_EN_SET9_RESETVALUE               _UINT32_(0x00)                                       /*  (ECIA_EN_SET9) GIRQ9 Enable Set Register  Reset Value */

#define ECIA_EN_SET9_Msk                      _UINT32_(0x00000000)                                 /* (ECIA_EN_SET9) Register Mask  */


/* -------- ECIA_RESULT9 : (ECIA Offset: 0x1C) ( R/ 32) GIRQ9 Result Register -------- */
#define ECIA_RESULT9_RESETVALUE               _UINT32_(0x00)                                       /*  (ECIA_RESULT9) GIRQ9 Result Register  Reset Value */

#define ECIA_RESULT9_Msk                      _UINT32_(0x00000000)                                 /* (ECIA_RESULT9) Register Mask  */


/* -------- ECIA_EN_CLR9 : (ECIA Offset: 0x20) (R/W 32) GIRQ9 Enable Clear Register -------- */
#define ECIA_EN_CLR9_RESETVALUE               _UINT32_(0x00)                                       /*  (ECIA_EN_CLR9) GIRQ9 Enable Clear Register  Reset Value */

#define ECIA_EN_CLR9_Msk                      _UINT32_(0x00000000)                                 /* (ECIA_EN_CLR9) Register Mask  */


/* -------- ECIA_SRC10 : (ECIA Offset: 0x28) (R/W 32) GIRQ10 Source Register -------- */
#define ECIA_SRC10_RESETVALUE                 _UINT32_(0x00)                                       /*  (ECIA_SRC10) GIRQ10 Source Register  Reset Value */

#define ECIA_SRC10_Msk                        _UINT32_(0x00000000)                                 /* (ECIA_SRC10) Register Mask  */


/* -------- ECIA_EN_SET10 : (ECIA Offset: 0x2C) (R/W 32) GIRQ10 Enable Set Register -------- */
#define ECIA_EN_SET10_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_SET10) GIRQ10 Enable Set Register  Reset Value */

#define ECIA_EN_SET10_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_SET10) Register Mask  */


/* -------- ECIA_RESULT10 : (ECIA Offset: 0x30) ( R/ 32) GIRQ10 Result Register -------- */
#define ECIA_RESULT10_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_RESULT10) GIRQ10 Result Register  Reset Value */

#define ECIA_RESULT10_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_RESULT10) Register Mask  */


/* -------- ECIA_EN_CLR10 : (ECIA Offset: 0x34) (R/W 32) GIRQ10 Enable Clear Register -------- */
#define ECIA_EN_CLR10_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_CLR10) GIRQ10 Enable Clear Register  Reset Value */

#define ECIA_EN_CLR10_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_CLR10) Register Mask  */


/* -------- ECIA_SRC11 : (ECIA Offset: 0x3C) (R/W 32) GIRQ11 Source Register -------- */
#define ECIA_SRC11_RESETVALUE                 _UINT32_(0x00)                                       /*  (ECIA_SRC11) GIRQ11 Source Register  Reset Value */

#define ECIA_SRC11_Msk                        _UINT32_(0x00000000)                                 /* (ECIA_SRC11) Register Mask  */


/* -------- ECIA_EN_SET11 : (ECIA Offset: 0x40) (R/W 32) GIRQ11 Enable Set Register -------- */
#define ECIA_EN_SET11_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_SET11) GIRQ11 Enable Set Register  Reset Value */

#define ECIA_EN_SET11_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_SET11) Register Mask  */


/* -------- ECIA_RESULT11 : (ECIA Offset: 0x44) ( R/ 32) GIRQ11 Result Register -------- */
#define ECIA_RESULT11_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_RESULT11) GIRQ11 Result Register  Reset Value */

#define ECIA_RESULT11_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_RESULT11) Register Mask  */


/* -------- ECIA_EN_CLR11 : (ECIA Offset: 0x48) (R/W 32) GIRQ11 Enable Clear Register -------- */
#define ECIA_EN_CLR11_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_CLR11) GIRQ11 Enable Clear Register  Reset Value */

#define ECIA_EN_CLR11_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_CLR11) Register Mask  */


/* -------- ECIA_SRC12 : (ECIA Offset: 0x50) (R/W 32) GIRQ12 Source Register -------- */
#define ECIA_SRC12_RESETVALUE                 _UINT32_(0x00)                                       /*  (ECIA_SRC12) GIRQ12 Source Register  Reset Value */

