MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cx_sg1/thirdparty/pic32cx_sg1/component/ecia.h
#define ECIA_SRC12_Msk                        _UINT32_(0x00000000)                                 /* (ECIA_SRC12) Register Mask  */


/* -------- ECIA_EN_SET12 : (ECIA Offset: 0x54) (R/W 32) GIRQ12 Enable Set Register -------- */
#define ECIA_EN_SET12_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_SET12) GIRQ12 Enable Set Register  Reset Value */

#define ECIA_EN_SET12_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_SET12) Register Mask  */


/* -------- ECIA_RESULT12 : (ECIA Offset: 0x58) ( R/ 32) GIRQ12 Result Register -------- */
#define ECIA_RESULT12_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_RESULT12) GIRQ12 Result Register  Reset Value */

#define ECIA_RESULT12_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_RESULT12) Register Mask  */


/* -------- ECIA_EN_CLR12 : (ECIA Offset: 0x5C) (R/W 32) GIRQ12 Enable Clear Register -------- */
#define ECIA_EN_CLR12_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_CLR12) GIRQ12 Enable Clear Register  Reset Value */

#define ECIA_EN_CLR12_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_CLR12) Register Mask  */


/* -------- ECIA_SRC13 : (ECIA Offset: 0x64) (R/W 32) GIRQ13 Source Register -------- */
#define ECIA_SRC13_RESETVALUE                 _UINT32_(0x00)                                       /*  (ECIA_SRC13) GIRQ13 Source Register  Reset Value */

#define ECIA_SRC13_Msk                        _UINT32_(0x00000000)                                 /* (ECIA_SRC13) Register Mask  */


/* -------- ECIA_EN_SET13 : (ECIA Offset: 0x68) (R/W 32) GIRQ13 Enable Set Register -------- */
#define ECIA_EN_SET13_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_SET13) GIRQ13 Enable Set Register  Reset Value */

#define ECIA_EN_SET13_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_SET13) Register Mask  */


/* -------- ECIA_RESULT13 : (ECIA Offset: 0x6C) ( R/ 32) GIRQ13 Result Register -------- */
#define ECIA_RESULT13_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_RESULT13) GIRQ13 Result Register  Reset Value */

#define ECIA_RESULT13_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_RESULT13) Register Mask  */


/* -------- ECIA_EN_CLR13 : (ECIA Offset: 0x70) (R/W 32) GIRQ13 Enable Clear Register -------- */
#define ECIA_EN_CLR13_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_CLR13) GIRQ13 Enable Clear Register  Reset Value */

#define ECIA_EN_CLR13_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_CLR13) Register Mask  */


/* -------- ECIA_SRC14 : (ECIA Offset: 0x78) (R/W 32) GIRQ14 Source Register -------- */
#define ECIA_SRC14_RESETVALUE                 _UINT32_(0x00)                                       /*  (ECIA_SRC14) GIRQ14 Source Register  Reset Value */

#define ECIA_SRC14_Msk                        _UINT32_(0x00000000)                                 /* (ECIA_SRC14) Register Mask  */


/* -------- ECIA_EN_SET14 : (ECIA Offset: 0x7C) (R/W 32) GIRQ14 Enable Set Register -------- */
#define ECIA_EN_SET14_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_SET14) GIRQ14 Enable Set Register  Reset Value */

#define ECIA_EN_SET14_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_SET14) Register Mask  */


/* -------- ECIA_RESULT14 : (ECIA Offset: 0x80) ( R/ 32) GIRQ14 Result Register -------- */
#define ECIA_RESULT14_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_RESULT14) GIRQ14 Result Register  Reset Value */

#define ECIA_RESULT14_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_RESULT14) Register Mask  */


/* -------- ECIA_EN_CLR14 : (ECIA Offset: 0x84) (R/W 32) GIRQ14 Enable Clear Register -------- */
#define ECIA_EN_CLR14_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_CLR14) GIRQ14 Enable Clear Register  Reset Value */

#define ECIA_EN_CLR14_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_CLR14) Register Mask  */


/* -------- ECIA_SRC15 : (ECIA Offset: 0x8C) (R/W 32) GIRQ15 Source Register -------- */
#define ECIA_SRC15_RESETVALUE                 _UINT32_(0x00)                                       /*  (ECIA_SRC15) GIRQ15 Source Register  Reset Value */

#define ECIA_SRC15_Msk                        _UINT32_(0x00000000)                                 /* (ECIA_SRC15) Register Mask  */


/* -------- ECIA_EN_SET15 : (ECIA Offset: 0x90) (R/W 32) GIRQ15 Enable Set Register -------- */
#define ECIA_EN_SET15_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_SET15) GIRQ15 Enable Set Register  Reset Value */

#define ECIA_EN_SET15_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_SET15) Register Mask  */


/* -------- ECIA_RESULT15 : (ECIA Offset: 0x94) ( R/ 32) GIRQ15 Result Register -------- */
#define ECIA_RESULT15_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_RESULT15) GIRQ15 Result Register  Reset Value */

#define ECIA_RESULT15_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_RESULT15) Register Mask  */


/* -------- ECIA_EN_CLR15 : (ECIA Offset: 0x98) (R/W 32) GIRQ15 Enable Clear Register -------- */
#define ECIA_EN_CLR15_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_CLR15) GIRQ15 Enable Clear Register  Reset Value */

#define ECIA_EN_CLR15_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_CLR15) Register Mask  */


/* -------- ECIA_SRC16 : (ECIA Offset: 0xA0) (R/W 32) GIRQ16 Source Register -------- */
#define ECIA_SRC16_RESETVALUE                 _UINT32_(0x00)                                       /*  (ECIA_SRC16) GIRQ16 Source Register  Reset Value */

