MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cx_sg1/thirdparty/pic32cx_sg1/component/ecia.h
#define ECIA_SRC16_Msk                        _UINT32_(0x00000000)                                 /* (ECIA_SRC16) Register Mask  */


/* -------- ECIA_EN_SET16 : (ECIA Offset: 0xA4) (R/W 32) GIRQ16 Enable Set Register -------- */
#define ECIA_EN_SET16_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_SET16) GIRQ16 Enable Set Register  Reset Value */

#define ECIA_EN_SET16_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_SET16) Register Mask  */


/* -------- ECIA_RESULT16 : (ECIA Offset: 0xA8) ( R/ 32) GIRQ16 Result Register -------- */
#define ECIA_RESULT16_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_RESULT16) GIRQ16 Result Register  Reset Value */

#define ECIA_RESULT16_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_RESULT16) Register Mask  */


/* -------- ECIA_EN_CLR16 : (ECIA Offset: 0xAC) (R/W 32) GIRQ16 Enable Clear Register -------- */
#define ECIA_EN_CLR16_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_CLR16) GIRQ16 Enable Clear Register  Reset Value */

#define ECIA_EN_CLR16_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_CLR16) Register Mask  */


/* -------- ECIA_SRC17 : (ECIA Offset: 0xB4) (R/W 32) GIRQ17 Source Register -------- */
#define ECIA_SRC17_RESETVALUE                 _UINT32_(0x00)                                       /*  (ECIA_SRC17) GIRQ17 Source Register  Reset Value */

#define ECIA_SRC17_Msk                        _UINT32_(0x00000000)                                 /* (ECIA_SRC17) Register Mask  */


/* -------- ECIA_EN_SET17 : (ECIA Offset: 0xB8) (R/W 32) GIRQ17 Enable Set Register -------- */
#define ECIA_EN_SET17_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_SET17) GIRQ17 Enable Set Register  Reset Value */

#define ECIA_EN_SET17_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_SET17) Register Mask  */


/* -------- ECIA_RESULT17 : (ECIA Offset: 0xBC) ( R/ 32) GIRQ17 Result Register -------- */
#define ECIA_RESULT17_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_RESULT17) GIRQ17 Result Register  Reset Value */

#define ECIA_RESULT17_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_RESULT17) Register Mask  */


/* -------- ECIA_EN_CLR17 : (ECIA Offset: 0xC0) (R/W 32) GIRQ17 Enable Clear Register -------- */
#define ECIA_EN_CLR17_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_CLR17) GIRQ17 Enable Clear Register  Reset Value */

#define ECIA_EN_CLR17_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_CLR17) Register Mask  */


/* -------- ECIA_SRC18 : (ECIA Offset: 0xC8) (R/W 32) GIRQ18 Source Register -------- */
#define ECIA_SRC18_RESETVALUE                 _UINT32_(0x00)                                       /*  (ECIA_SRC18) GIRQ18 Source Register  Reset Value */

#define ECIA_SRC18_Msk                        _UINT32_(0x00000000)                                 /* (ECIA_SRC18) Register Mask  */


/* -------- ECIA_EN_SET18 : (ECIA Offset: 0xCC) (R/W 32) GIRQ18 Enable Set Register -------- */
#define ECIA_EN_SET18_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_SET18) GIRQ18 Enable Set Register  Reset Value */

#define ECIA_EN_SET18_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_SET18) Register Mask  */


/* -------- ECIA_RESULT18 : (ECIA Offset: 0xD0) ( R/ 32) GIRQ18 Result Register -------- */
#define ECIA_RESULT18_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_RESULT18) GIRQ18 Result Register  Reset Value */

#define ECIA_RESULT18_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_RESULT18) Register Mask  */


/* -------- ECIA_EN_CLR18 : (ECIA Offset: 0xD4) (R/W 32) GIRQ18 Enable Clear Register -------- */
#define ECIA_EN_CLR18_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_CLR18) GIRQ18 Enable Clear Register  Reset Value */

#define ECIA_EN_CLR18_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_CLR18) Register Mask  */


/* -------- ECIA_SRC19 : (ECIA Offset: 0xDC) (R/W 32) GIRQ19 Source Register -------- */
#define ECIA_SRC19_RESETVALUE                 _UINT32_(0x00)                                       /*  (ECIA_SRC19) GIRQ19 Source Register  Reset Value */

#define ECIA_SRC19_Msk                        _UINT32_(0x00000000)                                 /* (ECIA_SRC19) Register Mask  */


/* -------- ECIA_EN_SET19 : (ECIA Offset: 0xE0) (R/W 32) GIRQ19 Enable Set Register -------- */
#define ECIA_EN_SET19_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_SET19) GIRQ19 Enable Set Register  Reset Value */

#define ECIA_EN_SET19_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_SET19) Register Mask  */


/* -------- ECIA_RESULT19 : (ECIA Offset: 0xE4) ( R/ 32) GIRQ19 Result Register -------- */
#define ECIA_RESULT19_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_RESULT19) GIRQ19 Result Register  Reset Value */

#define ECIA_RESULT19_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_RESULT19) Register Mask  */


/* -------- ECIA_EN_CLR19 : (ECIA Offset: 0xE8) (R/W 32) GIRQ19 Enable Clear Register -------- */
#define ECIA_EN_CLR19_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_CLR19) GIRQ19 Enable Clear Register  Reset Value */

#define ECIA_EN_CLR19_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_CLR19) Register Mask  */


