MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cx_sg1/thirdparty/pic32cx_sg1/component/ecia.h
/* -------- ECIA_SRC20 : (ECIA Offset: 0xF0) (R/W 32) GIRQ20 Source Register -------- */
#define ECIA_SRC20_RESETVALUE                 _UINT32_(0x00)                                       /*  (ECIA_SRC20) GIRQ20 Source Register  Reset Value */

#define ECIA_SRC20_Msk                        _UINT32_(0x00000000)                                 /* (ECIA_SRC20) Register Mask  */


/* -------- ECIA_EN_SET20 : (ECIA Offset: 0xF4) (R/W 32) GIRQ20 Enable Set Register -------- */
#define ECIA_EN_SET20_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_SET20) GIRQ20 Enable Set Register  Reset Value */

#define ECIA_EN_SET20_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_SET20) Register Mask  */


/* -------- ECIA_RESULT20 : (ECIA Offset: 0xF8) ( R/ 32) GIRQ20 Result Register -------- */
#define ECIA_RESULT20_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_RESULT20) GIRQ20 Result Register  Reset Value */

#define ECIA_RESULT20_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_RESULT20) Register Mask  */


/* -------- ECIA_EN_CLR20 : (ECIA Offset: 0xFC) (R/W 32) GIRQ20 Enable Clear Register -------- */
#define ECIA_EN_CLR20_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_CLR20) GIRQ20 Enable Clear Register  Reset Value */

#define ECIA_EN_CLR20_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_CLR20) Register Mask  */


/* -------- ECIA_SRC21 : (ECIA Offset: 0x104) (R/W 32) GIRQ21 Source Register -------- */
#define ECIA_SRC21_RESETVALUE                 _UINT32_(0x00)                                       /*  (ECIA_SRC21) GIRQ21 Source Register  Reset Value */

#define ECIA_SRC21_Msk                        _UINT32_(0x00000000)                                 /* (ECIA_SRC21) Register Mask  */


/* -------- ECIA_EN_SET21 : (ECIA Offset: 0x108) (R/W 32) GIRQ21 Enable Set Register -------- */
#define ECIA_EN_SET21_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_SET21) GIRQ21 Enable Set Register  Reset Value */

#define ECIA_EN_SET21_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_SET21) Register Mask  */


/* -------- ECIA_RESULT21 : (ECIA Offset: 0x10C) ( R/ 32) GIRQ21 Result Register -------- */
#define ECIA_RESULT21_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_RESULT21) GIRQ21 Result Register  Reset Value */

#define ECIA_RESULT21_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_RESULT21) Register Mask  */


/* -------- ECIA_EN_CLR21 : (ECIA Offset: 0x110) (R/W 32) GIRQ21 Enable Clear Register -------- */
#define ECIA_EN_CLR21_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_CLR21) GIRQ21 Enable Clear Register  Reset Value */

#define ECIA_EN_CLR21_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_CLR21) Register Mask  */


/* -------- ECIA_SRC22 : (ECIA Offset: 0x118) (R/W 32) GIRQ22 Source Register -------- */
#define ECIA_SRC22_RESETVALUE                 _UINT32_(0x00)                                       /*  (ECIA_SRC22) GIRQ22 Source Register  Reset Value */

#define ECIA_SRC22_Msk                        _UINT32_(0x00000000)                                 /* (ECIA_SRC22) Register Mask  */


/* -------- ECIA_EN_SET22 : (ECIA Offset: 0x11C) (R/W 32) GIRQ22 Enable Set Register -------- */
#define ECIA_EN_SET22_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_SET22) GIRQ22 Enable Set Register  Reset Value */

#define ECIA_EN_SET22_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_SET22) Register Mask  */


/* -------- ECIA_RESULT22 : (ECIA Offset: 0x120) ( R/ 32) GIRQ22 Result Register -------- */
#define ECIA_RESULT22_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_RESULT22) GIRQ22 Result Register  Reset Value */

#define ECIA_RESULT22_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_RESULT22) Register Mask  */


/* -------- ECIA_EN_CLR22 : (ECIA Offset: 0x124) (R/W 32) GIRQ22 Enable Clear Register -------- */
#define ECIA_EN_CLR22_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_CLR22) GIRQ22 Enable Clear Register  Reset Value */

#define ECIA_EN_CLR22_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_CLR22) Register Mask  */


/* -------- ECIA_SRC23 : (ECIA Offset: 0x12C) (R/W 32) GIRQ23 Source Register -------- */
#define ECIA_SRC23_RESETVALUE                 _UINT32_(0x00)                                       /*  (ECIA_SRC23) GIRQ23 Source Register  Reset Value */

#define ECIA_SRC23_Msk                        _UINT32_(0x00000000)                                 /* (ECIA_SRC23) Register Mask  */


/* -------- ECIA_EN_SET23 : (ECIA Offset: 0x130) (R/W 32) GIRQ23 Enable Set Register -------- */
#define ECIA_EN_SET23_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_SET23) GIRQ23 Enable Set Register  Reset Value */

#define ECIA_EN_SET23_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_SET23) Register Mask  */


/* -------- ECIA_RESULT23 : (ECIA Offset: 0x134) ( R/ 32) GIRQ23 Result Register -------- */
#define ECIA_RESULT23_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_RESULT23) GIRQ23 Result Register  Reset Value */

#define ECIA_RESULT23_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_RESULT23) Register Mask  */


/* -------- ECIA_EN_CLR23 : (ECIA Offset: 0x138) (R/W 32) GIRQ23 Enable Clear Register -------- */
#define ECIA_EN_CLR23_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_CLR23) GIRQ23 Enable Clear Register  Reset Value */

#define ECIA_EN_CLR23_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_CLR23) Register Mask  */


/* -------- ECIA_SRC24 : (ECIA Offset: 0x140) (R/W 32) GIRQ24 Source Register -------- */
#define ECIA_SRC24_RESETVALUE                 _UINT32_(0x00)                                       /*  (ECIA_SRC24) GIRQ24 Source Register  Reset Value */

#define ECIA_SRC24_Msk                        _UINT32_(0x00000000)                                 /* (ECIA_SRC24) Register Mask  */


