MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cx_sg1/thirdparty/pic32cx_sg1/component/ecia.h
/* -------- ECIA_EN_SET24 : (ECIA Offset: 0x144) (R/W 32) GIRQ24 Enable Set Register -------- */
#define ECIA_EN_SET24_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_SET24) GIRQ24 Enable Set Register  Reset Value */

#define ECIA_EN_SET24_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_SET24) Register Mask  */


/* -------- ECIA_RESULT24 : (ECIA Offset: 0x148) ( R/ 32) GIRQ24 Result Register -------- */
#define ECIA_RESULT24_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_RESULT24) GIRQ24 Result Register  Reset Value */

#define ECIA_RESULT24_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_RESULT24) Register Mask  */


/* -------- ECIA_EN_CLR24 : (ECIA Offset: 0x14C) (R/W 32) GIRQ24 Enable Clear Register -------- */
#define ECIA_EN_CLR24_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_CLR24) GIRQ24 Enable Clear Register  Reset Value */

#define ECIA_EN_CLR24_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_CLR24) Register Mask  */


/* -------- ECIA_SRC25 : (ECIA Offset: 0x154) (R/W 32) GIRQ25 Source Register -------- */
#define ECIA_SRC25_RESETVALUE                 _UINT32_(0x00)                                       /*  (ECIA_SRC25) GIRQ25 Source Register  Reset Value */

#define ECIA_SRC25_Msk                        _UINT32_(0x00000000)                                 /* (ECIA_SRC25) Register Mask  */


/* -------- ECIA_EN_SET25 : (ECIA Offset: 0x158) (R/W 32) GIRQ25 Enable Set Register -------- */
#define ECIA_EN_SET25_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_SET25) GIRQ25 Enable Set Register  Reset Value */

#define ECIA_EN_SET25_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_SET25) Register Mask  */


/* -------- ECIA_RESULT25 : (ECIA Offset: 0x15C) ( R/ 32) GIRQ25 Result Register -------- */
#define ECIA_RESULT25_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_RESULT25) GIRQ25 Result Register  Reset Value */

#define ECIA_RESULT25_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_RESULT25) Register Mask  */


/* -------- ECIA_EN_CLR25 : (ECIA Offset: 0x160) (R/W 32) GIRQ25 Enable Clear Register -------- */
#define ECIA_EN_CLR25_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_CLR25) GIRQ25 Enable Clear Register  Reset Value */

#define ECIA_EN_CLR25_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_CLR25) Register Mask  */


/* -------- ECIA_SRC26 : (ECIA Offset: 0x168) (R/W 32) GIRQ26 Source Register -------- */
#define ECIA_SRC26_RESETVALUE                 _UINT32_(0x00)                                       /*  (ECIA_SRC26) GIRQ26 Source Register  Reset Value */

#define ECIA_SRC26_Msk                        _UINT32_(0x00000000)                                 /* (ECIA_SRC26) Register Mask  */


/* -------- ECIA_EN_SET26 : (ECIA Offset: 0x16C) (R/W 32) GIRQ26 Enable Set Register -------- */
#define ECIA_EN_SET26_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_SET26) GIRQ26 Enable Set Register  Reset Value */

#define ECIA_EN_SET26_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_SET26) Register Mask  */


/* -------- ECIA_RESULT26 : (ECIA Offset: 0x170) ( R/ 32) GIRQ26 Result Register -------- */
#define ECIA_RESULT26_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_RESULT26) GIRQ26 Result Register  Reset Value */

#define ECIA_RESULT26_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_RESULT26) Register Mask  */


/* -------- ECIA_EN_CLR26 : (ECIA Offset: 0x174) (R/W 32) GIRQ26 Enable Clear Register -------- */
#define ECIA_EN_CLR26_RESETVALUE              _UINT32_(0x00)                                       /*  (ECIA_EN_CLR26) GIRQ26 Enable Clear Register  Reset Value */

#define ECIA_EN_CLR26_Msk                     _UINT32_(0x00000000)                                 /* (ECIA_EN_CLR26) Register Mask  */


/* -------- ECIA_BLK_EN_SET : (ECIA Offset: 0x200) (R/W 32) Block Enable Set Register -------- */
#define ECIA_BLK_EN_SET_RESETVALUE            _UINT32_(0x00)                                       /*  (ECIA_BLK_EN_SET) Block Enable Set Register  Reset Value */

#define ECIA_BLK_EN_SET_VTOR_EN_SET_Pos       _UINT32_(0)                                          /* (ECIA_BLK_EN_SET) Each GIRQx bit can be individually enabled to assert an interrupt event.\n      Reads always return the current value of the internal GIRQX_ENABLE bit. The state of the GIRQX_ENABLE bit is determined by\n      the corresponding GIRQX_ENABLE_SET bit and the GIRQX_ENABLE_CLEAR bit. (0=disabled, 1=enabled) (R/WS)\n      1=Interrupts in the GIRQx Source Register may be enabled\n      0=No effect. Position */
#define ECIA_BLK_EN_SET_VTOR_EN_SET_Msk       (_UINT32_(0x7FFFFFFF) << ECIA_BLK_EN_SET_VTOR_EN_SET_Pos) /* (ECIA_BLK_EN_SET) Each GIRQx bit can be individually enabled to assert an interrupt event.\n      Reads always return the current value of the internal GIRQX_ENABLE bit. The state of the GIRQX_ENABLE bit is determined by\n      the corresponding GIRQX_ENABLE_SET bit and the GIRQX_ENABLE_CLEAR bit. (0=disabled, 1=enabled) (R/WS)\n      1=Interrupts in the GIRQx Source Register may be enabled\n      0=No effect. Mask */
#define ECIA_BLK_EN_SET_VTOR_EN_SET(value)    (ECIA_BLK_EN_SET_VTOR_EN_SET_Msk & (_UINT32_(value) << ECIA_BLK_EN_SET_VTOR_EN_SET_Pos)) /* Assigment of value for VTOR_EN_SET in the ECIA_BLK_EN_SET register */
#define ECIA_BLK_EN_SET_Msk                   _UINT32_(0x7FFFFFFF)                                 /* (ECIA_BLK_EN_SET) Register Mask  */


/* -------- ECIA_BLK_EN_CLR : (ECIA Offset: 0x204) (R/W 32) Block Enable Clear Register. -------- */
#define ECIA_BLK_EN_CLR_RESETVALUE            _UINT32_(0x00)                                       /*  (ECIA_BLK_EN_CLR) Block Enable Clear Register.  Reset Value */

#define ECIA_BLK_EN_CLR_VTOR_EN_CLR_Pos       _UINT32_(0)                                          /* (ECIA_BLK_EN_CLR) Each GIRQx bit can be individually disabled to inhibit an interrupt event.\n      Reads always return the current value of the internal GIRQX_ENABLE bit. The state of the GIRQX_ENABLE bit is determined by\n      the corresponding GIRQX_ENABLE_SET bit and the GIRQX_ENABLE_CLEAR bit. (0=disabled, 1=enabled) (R/WC)\n      1=All interrupts in the GIRQx Source Register are disabled\n      0=No effect. Position */
#define ECIA_BLK_EN_CLR_VTOR_EN_CLR_Msk       (_UINT32_(0x7FFFFFFF) << ECIA_BLK_EN_CLR_VTOR_EN_CLR_Pos) /* (ECIA_BLK_EN_CLR) Each GIRQx bit can be individually disabled to inhibit an interrupt event.\n      Reads always return the current value of the internal GIRQX_ENABLE bit. The state of the GIRQX_ENABLE bit is determined by\n      the corresponding GIRQX_ENABLE_SET bit and the GIRQX_ENABLE_CLEAR bit. (0=disabled, 1=enabled) (R/WC)\n      1=All interrupts in the GIRQx Source Register are disabled\n      0=No effect. Mask */
#define ECIA_BLK_EN_CLR_VTOR_EN_CLR(value)    (ECIA_BLK_EN_CLR_VTOR_EN_CLR_Msk & (_UINT32_(value) << ECIA_BLK_EN_CLR_VTOR_EN_CLR_Pos)) /* Assigment of value for VTOR_EN_CLR in the ECIA_BLK_EN_CLR register */
#define ECIA_BLK_EN_CLR_Msk                   _UINT32_(0x7FFFFFFF)                                 /* (ECIA_BLK_EN_CLR) Register Mask  */


/* -------- ECIA_BLK_IRQ_VTOR : (ECIA Offset: 0x208) ( R/ 32) Block IRQ Vector Register -------- */
#define ECIA_BLK_IRQ_VTOR_RESETVALUE          _UINT32_(0x00)                                       /*  (ECIA_BLK_IRQ_VTOR) Block IRQ Vector Register  Reset Value */

#define ECIA_BLK_IRQ_VTOR_VTOR_Pos            _UINT32_(0)                                          /* (ECIA_BLK_IRQ_VTOR) Each bit in this field reports the status of the group GIRQ interrupt assertion to the NVIC. If the GIRQx interrupt\n      is disabled as a group, by the Block Enable Clear Register, then the corresponding bit will be '0'b and no interrupt will be asserted. Position */
#define ECIA_BLK_IRQ_VTOR_VTOR_Msk            (_UINT32_(0x1FFFFFF) << ECIA_BLK_IRQ_VTOR_VTOR_Pos)  /* (ECIA_BLK_IRQ_VTOR) Each bit in this field reports the status of the group GIRQ interrupt assertion to the NVIC. If the GIRQx interrupt\n      is disabled as a group, by the Block Enable Clear Register, then the corresponding bit will be '0'b and no interrupt will be asserted. Mask */
#define ECIA_BLK_IRQ_VTOR_VTOR(value)         (ECIA_BLK_IRQ_VTOR_VTOR_Msk & (_UINT32_(value) << ECIA_BLK_IRQ_VTOR_VTOR_Pos)) /* Assigment of value for VTOR in the ECIA_BLK_IRQ_VTOR register */
#define ECIA_BLK_IRQ_VTOR_Msk                 _UINT32_(0x01FFFFFF)                                 /* (ECIA_BLK_IRQ_VTOR) Register Mask  */


