MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cx_sg1/thirdparty/pic32cx_sg1/component/ecia.h
/** \brief ECIA register offsets definitions */
#define ECIA_SRC8_REG_OFST             _UINT32_(0x00)      /* (ECIA_SRC8) GIRQ8 Source Register Offset */
#define ECIA_EN_SET8_REG_OFST          _UINT32_(0x04)      /* (ECIA_EN_SET8) GIRQ8 Enable Set Register Offset */
#define ECIA_RESULT8_REG_OFST          _UINT32_(0x08)      /* (ECIA_RESULT8) GIRQ8 Result Register Offset */
#define ECIA_EN_CLR8_REG_OFST          _UINT32_(0x0C)      /* (ECIA_EN_CLR8) GIRQ8 Enable Clear Register Offset */
#define ECIA_SRC9_REG_OFST             _UINT32_(0x14)      /* (ECIA_SRC9) GIRQ9 Source Register Offset */
#define ECIA_EN_SET9_REG_OFST          _UINT32_(0x18)      /* (ECIA_EN_SET9) GIRQ9 Enable Set Register Offset */
#define ECIA_RESULT9_REG_OFST          _UINT32_(0x1C)      /* (ECIA_RESULT9) GIRQ9 Result Register Offset */
#define ECIA_EN_CLR9_REG_OFST          _UINT32_(0x20)      /* (ECIA_EN_CLR9) GIRQ9 Enable Clear Register Offset */
#define ECIA_SRC10_REG_OFST            _UINT32_(0x28)      /* (ECIA_SRC10) GIRQ10 Source Register Offset */
#define ECIA_EN_SET10_REG_OFST         _UINT32_(0x2C)      /* (ECIA_EN_SET10) GIRQ10 Enable Set Register Offset */
#define ECIA_RESULT10_REG_OFST         _UINT32_(0x30)      /* (ECIA_RESULT10) GIRQ10 Result Register Offset */
#define ECIA_EN_CLR10_REG_OFST         _UINT32_(0x34)      /* (ECIA_EN_CLR10) GIRQ10 Enable Clear Register Offset */
#define ECIA_SRC11_REG_OFST            _UINT32_(0x3C)      /* (ECIA_SRC11) GIRQ11 Source Register Offset */
#define ECIA_EN_SET11_REG_OFST         _UINT32_(0x40)      /* (ECIA_EN_SET11) GIRQ11 Enable Set Register Offset */
#define ECIA_RESULT11_REG_OFST         _UINT32_(0x44)      /* (ECIA_RESULT11) GIRQ11 Result Register Offset */
#define ECIA_EN_CLR11_REG_OFST         _UINT32_(0x48)      /* (ECIA_EN_CLR11) GIRQ11 Enable Clear Register Offset */
#define ECIA_SRC12_REG_OFST            _UINT32_(0x50)      /* (ECIA_SRC12) GIRQ12 Source Register Offset */
#define ECIA_EN_SET12_REG_OFST         _UINT32_(0x54)      /* (ECIA_EN_SET12) GIRQ12 Enable Set Register Offset */
#define ECIA_RESULT12_REG_OFST         _UINT32_(0x58)      /* (ECIA_RESULT12) GIRQ12 Result Register Offset */
#define ECIA_EN_CLR12_REG_OFST         _UINT32_(0x5C)      /* (ECIA_EN_CLR12) GIRQ12 Enable Clear Register Offset */
#define ECIA_SRC13_REG_OFST            _UINT32_(0x64)      /* (ECIA_SRC13) GIRQ13 Source Register Offset */
#define ECIA_EN_SET13_REG_OFST         _UINT32_(0x68)      /* (ECIA_EN_SET13) GIRQ13 Enable Set Register Offset */
#define ECIA_RESULT13_REG_OFST         _UINT32_(0x6C)      /* (ECIA_RESULT13) GIRQ13 Result Register Offset */
#define ECIA_EN_CLR13_REG_OFST         _UINT32_(0x70)      /* (ECIA_EN_CLR13) GIRQ13 Enable Clear Register Offset */
#define ECIA_SRC14_REG_OFST            _UINT32_(0x78)      /* (ECIA_SRC14) GIRQ14 Source Register Offset */
#define ECIA_EN_SET14_REG_OFST         _UINT32_(0x7C)      /* (ECIA_EN_SET14) GIRQ14 Enable Set Register Offset */
#define ECIA_RESULT14_REG_OFST         _UINT32_(0x80)      /* (ECIA_RESULT14) GIRQ14 Result Register Offset */
#define ECIA_EN_CLR14_REG_OFST         _UINT32_(0x84)      /* (ECIA_EN_CLR14) GIRQ14 Enable Clear Register Offset */
#define ECIA_SRC15_REG_OFST            _UINT32_(0x8C)      /* (ECIA_SRC15) GIRQ15 Source Register Offset */
#define ECIA_EN_SET15_REG_OFST         _UINT32_(0x90)      /* (ECIA_EN_SET15) GIRQ15 Enable Set Register Offset */
#define ECIA_RESULT15_REG_OFST         _UINT32_(0x94)      /* (ECIA_RESULT15) GIRQ15 Result Register Offset */
#define ECIA_EN_CLR15_REG_OFST         _UINT32_(0x98)      /* (ECIA_EN_CLR15) GIRQ15 Enable Clear Register Offset */
#define ECIA_SRC16_REG_OFST            _UINT32_(0xA0)      /* (ECIA_SRC16) GIRQ16 Source Register Offset */
#define ECIA_EN_SET16_REG_OFST         _UINT32_(0xA4)      /* (ECIA_EN_SET16) GIRQ16 Enable Set Register Offset */
#define ECIA_RESULT16_REG_OFST         _UINT32_(0xA8)      /* (ECIA_RESULT16) GIRQ16 Result Register Offset */
#define ECIA_EN_CLR16_REG_OFST         _UINT32_(0xAC)      /* (ECIA_EN_CLR16) GIRQ16 Enable Clear Register Offset */
#define ECIA_SRC17_REG_OFST            _UINT32_(0xB4)      /* (ECIA_SRC17) GIRQ17 Source Register Offset */
#define ECIA_EN_SET17_REG_OFST         _UINT32_(0xB8)      /* (ECIA_EN_SET17) GIRQ17 Enable Set Register Offset */
#define ECIA_RESULT17_REG_OFST         _UINT32_(0xBC)      /* (ECIA_RESULT17) GIRQ17 Result Register Offset */
#define ECIA_EN_CLR17_REG_OFST         _UINT32_(0xC0)      /* (ECIA_EN_CLR17) GIRQ17 Enable Clear Register Offset */
#define ECIA_SRC18_REG_OFST            _UINT32_(0xC8)      /* (ECIA_SRC18) GIRQ18 Source Register Offset */
#define ECIA_EN_SET18_REG_OFST         _UINT32_(0xCC)      /* (ECIA_EN_SET18) GIRQ18 Enable Set Register Offset */
#define ECIA_RESULT18_REG_OFST         _UINT32_(0xD0)      /* (ECIA_RESULT18) GIRQ18 Result Register Offset */
#define ECIA_EN_CLR18_REG_OFST         _UINT32_(0xD4)      /* (ECIA_EN_CLR18) GIRQ18 Enable Clear Register Offset */
#define ECIA_SRC19_REG_OFST            _UINT32_(0xDC)      /* (ECIA_SRC19) GIRQ19 Source Register Offset */
#define ECIA_EN_SET19_REG_OFST         _UINT32_(0xE0)      /* (ECIA_EN_SET19) GIRQ19 Enable Set Register Offset */
#define ECIA_RESULT19_REG_OFST         _UINT32_(0xE4)      /* (ECIA_RESULT19) GIRQ19 Result Register Offset */
#define ECIA_EN_CLR19_REG_OFST         _UINT32_(0xE8)      /* (ECIA_EN_CLR19) GIRQ19 Enable Clear Register Offset */
#define ECIA_SRC20_REG_OFST            _UINT32_(0xF0)      /* (ECIA_SRC20) GIRQ20 Source Register Offset */
#define ECIA_EN_SET20_REG_OFST         _UINT32_(0xF4)      /* (ECIA_EN_SET20) GIRQ20 Enable Set Register Offset */
#define ECIA_RESULT20_REG_OFST         _UINT32_(0xF8)      /* (ECIA_RESULT20) GIRQ20 Result Register Offset */
#define ECIA_EN_CLR20_REG_OFST         _UINT32_(0xFC)      /* (ECIA_EN_CLR20) GIRQ20 Enable Clear Register Offset */
#define ECIA_SRC21_REG_OFST            _UINT32_(0x104)     /* (ECIA_SRC21) GIRQ21 Source Register Offset */
#define ECIA_EN_SET21_REG_OFST         _UINT32_(0x108)     /* (ECIA_EN_SET21) GIRQ21 Enable Set Register Offset */
#define ECIA_RESULT21_REG_OFST         _UINT32_(0x10C)     /* (ECIA_RESULT21) GIRQ21 Result Register Offset */
#define ECIA_EN_CLR21_REG_OFST         _UINT32_(0x110)     /* (ECIA_EN_CLR21) GIRQ21 Enable Clear Register Offset */
#define ECIA_SRC22_REG_OFST            _UINT32_(0x118)     /* (ECIA_SRC22) GIRQ22 Source Register Offset */
#define ECIA_EN_SET22_REG_OFST         _UINT32_(0x11C)     /* (ECIA_EN_SET22) GIRQ22 Enable Set Register Offset */
#define ECIA_RESULT22_REG_OFST         _UINT32_(0x120)     /* (ECIA_RESULT22) GIRQ22 Result Register Offset */
#define ECIA_EN_CLR22_REG_OFST         _UINT32_(0x124)     /* (ECIA_EN_CLR22) GIRQ22 Enable Clear Register Offset */
#define ECIA_SRC23_REG_OFST            _UINT32_(0x12C)     /* (ECIA_SRC23) GIRQ23 Source Register Offset */
#define ECIA_EN_SET23_REG_OFST         _UINT32_(0x130)     /* (ECIA_EN_SET23) GIRQ23 Enable Set Register Offset */
#define ECIA_RESULT23_REG_OFST         _UINT32_(0x134)     /* (ECIA_RESULT23) GIRQ23 Result Register Offset */
#define ECIA_EN_CLR23_REG_OFST         _UINT32_(0x138)     /* (ECIA_EN_CLR23) GIRQ23 Enable Clear Register Offset */
#define ECIA_SRC24_REG_OFST            _UINT32_(0x140)     /* (ECIA_SRC24) GIRQ24 Source Register Offset */
#define ECIA_EN_SET24_REG_OFST         _UINT32_(0x144)     /* (ECIA_EN_SET24) GIRQ24 Enable Set Register Offset */
#define ECIA_RESULT24_REG_OFST         _UINT32_(0x148)     /* (ECIA_RESULT24) GIRQ24 Result Register Offset */
#define ECIA_EN_CLR24_REG_OFST         _UINT32_(0x14C)     /* (ECIA_EN_CLR24) GIRQ24 Enable Clear Register Offset */
#define ECIA_SRC25_REG_OFST            _UINT32_(0x154)     /* (ECIA_SRC25) GIRQ25 Source Register Offset */
#define ECIA_EN_SET25_REG_OFST         _UINT32_(0x158)     /* (ECIA_EN_SET25) GIRQ25 Enable Set Register Offset */
#define ECIA_RESULT25_REG_OFST         _UINT32_(0x15C)     /* (ECIA_RESULT25) GIRQ25 Result Register Offset */
#define ECIA_EN_CLR25_REG_OFST         _UINT32_(0x160)     /* (ECIA_EN_CLR25) GIRQ25 Enable Clear Register Offset */
#define ECIA_SRC26_REG_OFST            _UINT32_(0x168)     /* (ECIA_SRC26) GIRQ26 Source Register Offset */
#define ECIA_EN_SET26_REG_OFST         _UINT32_(0x16C)     /* (ECIA_EN_SET26) GIRQ26 Enable Set Register Offset */
#define ECIA_RESULT26_REG_OFST         _UINT32_(0x170)     /* (ECIA_RESULT26) GIRQ26 Result Register Offset */
#define ECIA_EN_CLR26_REG_OFST         _UINT32_(0x174)     /* (ECIA_EN_CLR26) GIRQ26 Enable Clear Register Offset */
#define ECIA_BLK_EN_SET_REG_OFST       _UINT32_(0x200)     /* (ECIA_BLK_EN_SET) Block Enable Set Register Offset */
#define ECIA_BLK_EN_CLR_REG_OFST       _UINT32_(0x204)     /* (ECIA_BLK_EN_CLR) Block Enable Clear Register. Offset */
#define ECIA_BLK_IRQ_VTOR_REG_OFST     _UINT32_(0x208)     /* (ECIA_BLK_IRQ_VTOR) Block IRQ Vector Register Offset */

