MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cx_sg1/thirdparty/pic32cx_sg1/component/ecia.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief ECIA register API structure */
typedef struct
{  /* The ECIA works in conjunction with the processor interrupt interface to handle hardware interrupts andd exceptions. */
  __IO  uint32_t                       ECIA_SRC8;          /**< Offset: 0x00 (R/W  32) GIRQ8 Source Register */
  __IO  uint32_t                       ECIA_EN_SET8;       /**< Offset: 0x04 (R/W  32) GIRQ8 Enable Set Register */
  __I   uint32_t                       ECIA_RESULT8;       /**< Offset: 0x08 (R/   32) GIRQ8 Result Register */
  __IO  uint32_t                       ECIA_EN_CLR8;       /**< Offset: 0x0C (R/W  32) GIRQ8 Enable Clear Register */
  __I   uint8_t                        Reserved1[0x04];
  __IO  uint32_t                       ECIA_SRC9;          /**< Offset: 0x14 (R/W  32) GIRQ9 Source Register */
  __IO  uint32_t                       ECIA_EN_SET9;       /**< Offset: 0x18 (R/W  32) GIRQ9 Enable Set Register */
  __I   uint32_t                       ECIA_RESULT9;       /**< Offset: 0x1C (R/   32) GIRQ9 Result Register */
  __IO  uint32_t                       ECIA_EN_CLR9;       /**< Offset: 0x20 (R/W  32) GIRQ9 Enable Clear Register */
  __I   uint8_t                        Reserved2[0x04];
  __IO  uint32_t                       ECIA_SRC10;         /**< Offset: 0x28 (R/W  32) GIRQ10 Source Register */
  __IO  uint32_t                       ECIA_EN_SET10;      /**< Offset: 0x2C (R/W  32) GIRQ10 Enable Set Register */
  __I   uint32_t                       ECIA_RESULT10;      /**< Offset: 0x30 (R/   32) GIRQ10 Result Register */
  __IO  uint32_t                       ECIA_EN_CLR10;      /**< Offset: 0x34 (R/W  32) GIRQ10 Enable Clear Register */
  __I   uint8_t                        Reserved3[0x04];
  __IO  uint32_t                       ECIA_SRC11;         /**< Offset: 0x3C (R/W  32) GIRQ11 Source Register */
  __IO  uint32_t                       ECIA_EN_SET11;      /**< Offset: 0x40 (R/W  32) GIRQ11 Enable Set Register */
  __I   uint32_t                       ECIA_RESULT11;      /**< Offset: 0x44 (R/   32) GIRQ11 Result Register */
  __IO  uint32_t                       ECIA_EN_CLR11;      /**< Offset: 0x48 (R/W  32) GIRQ11 Enable Clear Register */
  __I   uint8_t                        Reserved4[0x04];
  __IO  uint32_t                       ECIA_SRC12;         /**< Offset: 0x50 (R/W  32) GIRQ12 Source Register */
  __IO  uint32_t                       ECIA_EN_SET12;      /**< Offset: 0x54 (R/W  32) GIRQ12 Enable Set Register */
  __I   uint32_t                       ECIA_RESULT12;      /**< Offset: 0x58 (R/   32) GIRQ12 Result Register */
  __IO  uint32_t                       ECIA_EN_CLR12;      /**< Offset: 0x5C (R/W  32) GIRQ12 Enable Clear Register */
  __I   uint8_t                        Reserved5[0x04];
  __IO  uint32_t                       ECIA_SRC13;         /**< Offset: 0x64 (R/W  32) GIRQ13 Source Register */
  __IO  uint32_t                       ECIA_EN_SET13;      /**< Offset: 0x68 (R/W  32) GIRQ13 Enable Set Register */
  __I   uint32_t                       ECIA_RESULT13;      /**< Offset: 0x6C (R/   32) GIRQ13 Result Register */
  __IO  uint32_t                       ECIA_EN_CLR13;      /**< Offset: 0x70 (R/W  32) GIRQ13 Enable Clear Register */
  __I   uint8_t                        Reserved6[0x04];
  __IO  uint32_t                       ECIA_SRC14;         /**< Offset: 0x78 (R/W  32) GIRQ14 Source Register */
  __IO  uint32_t                       ECIA_EN_SET14;      /**< Offset: 0x7C (R/W  32) GIRQ14 Enable Set Register */
  __I   uint32_t                       ECIA_RESULT14;      /**< Offset: 0x80 (R/   32) GIRQ14 Result Register */
  __IO  uint32_t                       ECIA_EN_CLR14;      /**< Offset: 0x84 (R/W  32) GIRQ14 Enable Clear Register */
  __I   uint8_t                        Reserved7[0x04];
  __IO  uint32_t                       ECIA_SRC15;         /**< Offset: 0x8C (R/W  32) GIRQ15 Source Register */
  __IO  uint32_t                       ECIA_EN_SET15;      /**< Offset: 0x90 (R/W  32) GIRQ15 Enable Set Register */
  __I   uint32_t                       ECIA_RESULT15;      /**< Offset: 0x94 (R/   32) GIRQ15 Result Register */
  __IO  uint32_t                       ECIA_EN_CLR15;      /**< Offset: 0x98 (R/W  32) GIRQ15 Enable Clear Register */
  __I   uint8_t                        Reserved8[0x04];
  __IO  uint32_t                       ECIA_SRC16;         /**< Offset: 0xA0 (R/W  32) GIRQ16 Source Register */
  __IO  uint32_t                       ECIA_EN_SET16;      /**< Offset: 0xA4 (R/W  32) GIRQ16 Enable Set Register */
  __I   uint32_t                       ECIA_RESULT16;      /**< Offset: 0xA8 (R/   32) GIRQ16 Result Register */
  __IO  uint32_t                       ECIA_EN_CLR16;      /**< Offset: 0xAC (R/W  32) GIRQ16 Enable Clear Register */
  __I   uint8_t                        Reserved9[0x04];
  __IO  uint32_t                       ECIA_SRC17;         /**< Offset: 0xB4 (R/W  32) GIRQ17 Source Register */
  __IO  uint32_t                       ECIA_EN_SET17;      /**< Offset: 0xB8 (R/W  32) GIRQ17 Enable Set Register */
  __I   uint32_t                       ECIA_RESULT17;      /**< Offset: 0xBC (R/   32) GIRQ17 Result Register */
  __IO  uint32_t                       ECIA_EN_CLR17;      /**< Offset: 0xC0 (R/W  32) GIRQ17 Enable Clear Register */
  __I   uint8_t                        Reserved10[0x04];
  __IO  uint32_t                       ECIA_SRC18;         /**< Offset: 0xC8 (R/W  32) GIRQ18 Source Register */
  __IO  uint32_t                       ECIA_EN_SET18;      /**< Offset: 0xCC (R/W  32) GIRQ18 Enable Set Register */
  __I   uint32_t                       ECIA_RESULT18;      /**< Offset: 0xD0 (R/   32) GIRQ18 Result Register */
  __IO  uint32_t                       ECIA_EN_CLR18;      /**< Offset: 0xD4 (R/W  32) GIRQ18 Enable Clear Register */
  __I   uint8_t                        Reserved11[0x04];
  __IO  uint32_t                       ECIA_SRC19;         /**< Offset: 0xDC (R/W  32) GIRQ19 Source Register */
  __IO  uint32_t                       ECIA_EN_SET19;      /**< Offset: 0xE0 (R/W  32) GIRQ19 Enable Set Register */
  __I   uint32_t                       ECIA_RESULT19;      /**< Offset: 0xE4 (R/   32) GIRQ19 Result Register */
  __IO  uint32_t                       ECIA_EN_CLR19;      /**< Offset: 0xE8 (R/W  32) GIRQ19 Enable Clear Register */
  __I   uint8_t                        Reserved12[0x04];
  __IO  uint32_t                       ECIA_SRC20;         /**< Offset: 0xF0 (R/W  32) GIRQ20 Source Register */
  __IO  uint32_t                       ECIA_EN_SET20;      /**< Offset: 0xF4 (R/W  32) GIRQ20 Enable Set Register */
  __I   uint32_t                       ECIA_RESULT20;      /**< Offset: 0xF8 (R/   32) GIRQ20 Result Register */
  __IO  uint32_t                       ECIA_EN_CLR20;      /**< Offset: 0xFC (R/W  32) GIRQ20 Enable Clear Register */
  __I   uint8_t                        Reserved13[0x04];
  __IO  uint32_t                       ECIA_SRC21;         /**< Offset: 0x104 (R/W  32) GIRQ21 Source Register */
  __IO  uint32_t                       ECIA_EN_SET21;      /**< Offset: 0x108 (R/W  32) GIRQ21 Enable Set Register */
  __I   uint32_t                       ECIA_RESULT21;      /**< Offset: 0x10C (R/   32) GIRQ21 Result Register */
  __IO  uint32_t                       ECIA_EN_CLR21;      /**< Offset: 0x110 (R/W  32) GIRQ21 Enable Clear Register */
  __I   uint8_t                        Reserved14[0x04];
  __IO  uint32_t                       ECIA_SRC22;         /**< Offset: 0x118 (R/W  32) GIRQ22 Source Register */
  __IO  uint32_t                       ECIA_EN_SET22;      /**< Offset: 0x11C (R/W  32) GIRQ22 Enable Set Register */
  __I   uint32_t                       ECIA_RESULT22;      /**< Offset: 0x120 (R/   32) GIRQ22 Result Register */
  __IO  uint32_t                       ECIA_EN_CLR22;      /**< Offset: 0x124 (R/W  32) GIRQ22 Enable Clear Register */
  __I   uint8_t                        Reserved15[0x04];
  __IO  uint32_t                       ECIA_SRC23;         /**< Offset: 0x12C (R/W  32) GIRQ23 Source Register */
  __IO  uint32_t                       ECIA_EN_SET23;      /**< Offset: 0x130 (R/W  32) GIRQ23 Enable Set Register */
  __I   uint32_t                       ECIA_RESULT23;      /**< Offset: 0x134 (R/   32) GIRQ23 Result Register */
  __IO  uint32_t                       ECIA_EN_CLR23;      /**< Offset: 0x138 (R/W  32) GIRQ23 Enable Clear Register */
  __I   uint8_t                        Reserved16[0x04];
  __IO  uint32_t                       ECIA_SRC24;         /**< Offset: 0x140 (R/W  32) GIRQ24 Source Register */
  __IO  uint32_t                       ECIA_EN_SET24;      /**< Offset: 0x144 (R/W  32) GIRQ24 Enable Set Register */
  __I   uint32_t                       ECIA_RESULT24;      /**< Offset: 0x148 (R/   32) GIRQ24 Result Register */
  __IO  uint32_t                       ECIA_EN_CLR24;      /**< Offset: 0x14C (R/W  32) GIRQ24 Enable Clear Register */
  __I   uint8_t                        Reserved17[0x04];
  __IO  uint32_t                       ECIA_SRC25;         /**< Offset: 0x154 (R/W  32) GIRQ25 Source Register */
  __IO  uint32_t                       ECIA_EN_SET25;      /**< Offset: 0x158 (R/W  32) GIRQ25 Enable Set Register */
  __I   uint32_t                       ECIA_RESULT25;      /**< Offset: 0x15C (R/   32) GIRQ25 Result Register */
  __IO  uint32_t                       ECIA_EN_CLR25;      /**< Offset: 0x160 (R/W  32) GIRQ25 Enable Clear Register */
  __I   uint8_t                        Reserved18[0x04];
  __IO  uint32_t                       ECIA_SRC26;         /**< Offset: 0x168 (R/W  32) GIRQ26 Source Register */
  __IO  uint32_t                       ECIA_EN_SET26;      /**< Offset: 0x16C (R/W  32) GIRQ26 Enable Set Register */
  __I   uint32_t                       ECIA_RESULT26;      /**< Offset: 0x170 (R/   32) GIRQ26 Result Register */
  __IO  uint32_t                       ECIA_EN_CLR26;      /**< Offset: 0x174 (R/W  32) GIRQ26 Enable Clear Register */
  __I   uint8_t                        Reserved19[0x88];
  __IO  uint32_t                       ECIA_BLK_EN_SET;    /**< Offset: 0x200 (R/W  32) Block Enable Set Register */
  __IO  uint32_t                       ECIA_BLK_EN_CLR;    /**< Offset: 0x204 (R/W  32) Block Enable Clear Register. */
  __I   uint32_t                       ECIA_BLK_IRQ_VTOR;  /**< Offset: 0x208 (R/   32) Block IRQ Vector Register */
} ecia_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _0525SG12_ECIA_COMPONENT_H_ */
